; domain
;Domain File

(define (domain delivery3-strips)
  (:predicates 
    (truck ?t)
    (package ?p)
    (at-truck ?t ?loc)
    (at-package ?p ?loc))

  (:action drive
    :parameters (?from ?to ?t)
    :precondition (and (truck ?t) (at-truck ?t ?from))
    :effect (and (at-truck ?t ?to) (not (at-truck ?t ?from))))

  (:action load
    :parameters (?p ?loc ?t)
    :precondition (and (package ?p) (truck ?t) (at-package ?p ?loc) (at-truck ?t ?loc))
    :effect (and (not (at-package ?p ?loc)) (at-package ?p ?t)))

  (:action unload
    :parameters (?p ?loc ?t)
    :precondition (and (package ?p) (truck ?t) (at-truck ?t ?loc) (at-package ?p ?t))
    :effect (and (at-package ?p ?loc) (not (at-package ?p ?t))))
)

; problem
;Problem File

(define (problem delivery3-problem)
  (:domain delivery3-strips)
  (:objects changi tampines bedok truck1 package1 package2)
  (:init
    (truck truck1)
    (package package1)
    (package package2)
    (at-truck truck1 tampines)
    (at-package package1 bedok)
    (at-package package2 changi))
  (:goal (and
           (at-package package1 changi)
           (at-package package2 bedok))))

; plan
1. (drive tampines bedok truck1)
   deleted: (at-truck truck1 tampines)
   added: (at-truck truck1 bedok)
   goals met: 0 of 2
2. (load package1 bedok truck1)
   deleted: (at-package package1 bedok)
   added: (at-package package1 truck1)
   goals met: 0 of 2
3. (drive bedok changi truck1)
   deleted: (at-truck truck1 bedok)
   added: (at-truck truck1 changi)
   goals met: 0 of 2
4. (unload package1 changi truck1)
   deleted: (at-package package1 truck1)
   added: (at-package package1 changi)
   goals met: 1 of 2
5. (load package2 changi truck1)
   deleted: (at-package package2 changi)
   added: (at-package package2 truck1)
   goals met: 1 of 2
6. (drive changi bedok truck1)
   deleted: (at-truck truck1 changi)
   added: (at-truck truck1 bedok)
   goals met: 1 of 2
7. (unload package2 bedok truck1)
   deleted: (at-package package2 truck1)
   added: (at-package package2 bedok)
   goals met: 2 of 2
